In [1]:
#Importing packages
import pandas as pd
import numpy as np

In [2]:
# #TO create a DF
# 1.Determine the columns
# 2.Using for loop  and numpy generate some fake values
# 3.Create a empty Dataframe

In [3]:
df=pd.DataFrame(columns=['COlumn1','COlumn2'])

In [4]:
df

Empty DataFrame
Columns: [COlumn1, COlumn2]
Index: []

In [5]:
df['COlumn1']=np.random.choice([1,0],99)

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df

    COlumn1 COlumn2
0         0     NaN
1         0     NaN
2         0     NaN
3         1     NaN
4         0     NaN
..      ...     ...
94        0     NaN
95        1     NaN
96        0     NaN
97        1     NaN
98        0     NaN

[99 rows x 2 columns]

In [8]:
df.iloc[1,1]=58

In [9]:
df

    COlumn1 COlumn2
0         0     NaN
1         0      58
2         0     NaN
3         1     NaN
4         0     NaN
..      ...     ...
94        0     NaN
95        1     NaN
96        0     NaN
97        1     NaN
98        0     NaN

[99 rows x 2 columns]

In [10]:
df.iloc[0,1]=58

In [11]:
df

    COlumn1 COlumn2
0         0      58
1         0      58
2         0     NaN
3         1     NaN
4         0     NaN
..      ...     ...
94        0     NaN
95        1     NaN
96        0     NaN
97        1     NaN
98        0     NaN

[99 rows x 2 columns]

In [12]:
dic={'COlumn1':47,'COlumn2':57}

In [13]:
new_df=pd.DataFrame(dic,index=[99])

In [14]:
df=pd.concat([df,new_df])

In [15]:
df

    COlumn1 COlumn2
0         0      58
1         0      58
2         0     NaN
3         1     NaN
4         0     NaN
..      ...     ...
95        1     NaN
96        0     NaN
97        1     NaN
98        0     NaN
99       47      57

[100 rows x 2 columns]

In [16]:
df['COlumn3']=np.arange(1,101,1)

In [17]:
df

    COlumn1 COlumn2  COlumn3
0         0      58        1
1         0      58        2
2         0     NaN        3
3         1     NaN        4
4         0     NaN        5
..      ...     ...      ...
95        1     NaN       96
96        0     NaN       97
97        1     NaN       98
98        0     NaN       99
99       47      57      100

[100 rows x 3 columns]

In [18]:
df['COlumn2'].fillna(df['COlumn2'].mean())

0     58.000000
1     58.000000
2     57.666667
3     57.666667
4     57.666667
        ...
95    57.666667
96    57.666667
97    57.666667
98    57.666667
99    57.000000
Name: COlumn2, Length: 100, dtype: float64

In [19]:
df['COlumn2']=df['COlumn2'].fillna(df['COlumn2'].mean())

In [20]:
df

    COlumn1    COlumn2  COlumn3
0         0  58.000000        1
1         0  58.000000        2
2         0  57.666667        3
3         1  57.666667        4
4         0  57.666667        5
..      ...        ...      ...
95        1  57.666667       96
96        0  57.666667       97
97        1  57.666667       98
98        0  57.666667       99
99       47  57.000000      100

[100 rows x 3 columns]

In [21]:
df.isnull()

    COlumn1  COlumn2  COlumn3
0     False    False    False
1     False    False    False
2     False    False    False
3     False    False    False
4     False    False    False
..      ...      ...      ...
95    False    False    False
96    False    False    False
97    False    False    False
98    False    False    False
99    False    False    False

[100 rows x 3 columns]

In [22]:
import math
math.floor(df['COlumn2'].mean())

57

In [23]:
df.describe()

          COlumn1     COlumn2     COlumn3
count  100.000000  100.000000  100.000000
mean     0.930000   57.666667   50.500000
std      4.680186    0.082061   29.011492
min      0.000000   57.000000    1.000000
25%      0.000000   57.666667   25.750000
50%      0.000000   57.666667   50.500000
75%      1.000000   57.666667   75.250000
max     47.000000   58.000000  100.000000

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   COlumn1  100 non-null    int64
 1   COlumn2  100 non-null    float64
 2   COlumn3  100 non-null    int32
dtypes: float64(1), int32(1), int64(1)
memory usage: 2.7 KB

In [25]:
for x in df.index:
    print(x)

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99

In [26]:
df.columns

Index(['COlumn1', 'COlumn2', 'COlumn3'], dtype='object')

In [27]:
df.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
            17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
            34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
            51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67,
            68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84,
            85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64')

In [28]:
df['COlumn4']=np.random.choice(['AI&ML','AI&DA','CYS'],100)

In [29]:
a=np.random.choice(['AI&ML','AI&DA','CYS'],100)

In [30]:
a

array(['AI&DA', 'CYS', 'AI&ML', 'AI&DA', 'CYS', 'CYS', 'CYS', 'CYS',
       'AI&DA', 'CYS', 'AI&ML', 'CYS', 'AI&ML', 'CYS', 'CYS', 'AI&ML',
       'AI&ML', 'CYS', 'CYS', 'AI&DA', 'AI&DA', 'AI&DA', 'AI&DA', 'CYS',
       'AI&ML', 'CYS', 'CYS', 'CYS', 'AI&DA', 'AI&DA', 'AI&ML', 'AI&DA',
       'AI&DA', 'AI&ML', 'CYS', 'AI&ML', 'CYS', 'CYS', 'AI&ML', 'AI&DA',
       'CYS', 'AI&ML', 'CYS', 'CYS', 'AI&ML', 'CYS', 'AI&ML', 'AI&DA',
       'AI&DA', 'AI&ML', 'AI&ML', 'AI&ML', 'CYS', 'AI&DA', 'AI&DA',
       'AI&DA', 'AI&ML', 'AI&DA', 'CYS', 'AI&ML', 'AI&DA', 'AI&ML',
       'AI&ML', 'CYS', 'AI&DA', 'AI&DA', 'AI&ML', 'AI&DA', 'AI&ML', 'CYS',
       'AI&ML', 'AI&DA', 'AI&DA', 'AI&DA', 'AI&ML', 'AI&DA', 'AI&ML',
       'AI&DA', 'CYS', 'AI&DA', 'CYS', 'CYS', 'AI&ML', 'AI&DA', 'AI&DA',
       'AI&DA', 'CYS', 'AI&DA', 'AI&DA', 'AI&ML', 'AI&DA', 'CYS', 'AI&ML',
       'AI&ML', 'AI&DA', 'AI&ML', 'AI&DA', 'CYS', 'CYS', 'CYS'],
      dtype='<U5')

In [31]:
df['Column4']=a

In [32]:
df

    COlumn1    COlumn2  COlumn3 COlumn4 Column4
0         0  58.000000        1     CYS   AI&DA
1         0  58.000000        2   AI&ML     CYS
2         0  57.666667        3     CYS   AI&ML
3         1  57.666667        4   AI&DA   AI&DA
4         0  57.666667        5   AI&DA     CYS
..      ...        ...      ...     ...     ...
95        1  57.666667       96     CYS   AI&ML
96        0  57.666667       97   AI&ML   AI&DA
97        1  57.666667       98   AI&ML     CYS
98        0  57.666667       99     CYS     CYS
99       47  57.000000      100   AI&DA     CYS

[100 rows x 5 columns]

In [34]:
df.loc[0,'Column4']="DA"

In [35]:
df

    COlumn1    COlumn2  COlumn3 COlumn4 Column4
0         0  58.000000        1     CYS      DA
1         0  58.000000        2   AI&ML     CYS
2         0  57.666667        3     CYS   AI&ML
3         1  57.666667        4   AI&DA   AI&DA
4         0  57.666667        5   AI&DA     CYS
..      ...        ...      ...     ...     ...
95        1  57.666667       96     CYS   AI&ML
96        0  57.666667       97   AI&ML   AI&DA
97        1  57.666667       98   AI&ML     CYS
98        0  57.666667       99     CYS     CYS
99       47  57.000000      100   AI&DA     CYS

[100 rows x 5 columns]

In [36]:
set(df['Column4'])

{'AI&DA', 'AI&ML', 'CYS', 'DA'}

In [37]:
dic={'AI&DA':'Artificial Intelligence & Data Analytics','DA':'Artificial Intelligence & Data Analytics','AI&ML':'Artificial Intelligence & Machine Learning','CYS':'CYber Security'}

In [38]:
df['Column4']=df['Column4'].map(dic)

In [39]:
df

,COlumn1,COlumn2,COlumn3,COlumn4,Column4
0,0,58.000000,1,CYS,Artificial Intelligence & Data Analytics
1,0,58.000000,2,AI&ML,CYber Security
2,0,57.666667,3,CYS,Artificial Intelligence & Machine Learning
3,1,57.666667,4,AI&DA,Artificial Intelligence & Data Analytics
4,0,57.666667,5,AI&DA,CYber Security
...,...,...,...,...,...
95,1,57.666667,96,CYS,Artificial Intelligence & Machine Learning
96,0,57.666667,97,AI&ML,Artificial Intelligence & Data Analytics
97,1,57.666667,98,AI&ML,CYber Security
98,0,57.666667,99,CYS,CYber Security
99,47,57.000000,100,AI&DA,CYber Security

In [40]:
del df['COlumn4']

In [41]:
df

    COlumn1    COlumn2  COlumn3                                     Column4
0         0  58.000000        1    Artificial Intelligence & Data Analytics
1         0  58.000000        2                              CYber Security
2         0  57.666667        3  Artificial Intelligence & Machine Learning
3         1  57.666667        4    Artificial Intelligence & Data Analytics
4         0  57.666667        5                              CYber Security
..      ...        ...      ...                                         ...
95        1  57.666667       96  Artificial Intelligence & Machine Learning
96        0  57.666667       97    Artificial Intelligence & Data Analytics
97        1  57.666667       98                              CYber Security
98        0  57.666667       99                              CYber Security
99       47  57.000000      100                              CYber Security

[100 rows x 4 columns]

In [46]:
dic={'Artificial Intelligence & Machine Learning':'E01','CYber Security':'E02','Artificial Intelligence & Data Analytics':'E03'}

In [47]:
df['Column5']=df['Column4'].map(dic)

In [48]:
df['Column4']

0       Artificial Intelligence & Data Analytics
1                                 CYber Security
2     Artificial Intelligence & Machine Learning
3       Artificial Intelligence & Data Analytics
4                                 CYber Security
                         ...
95    Artificial Intelligence & Machine Learning
96      Artificial Intelligence & Data Analytics
97                                CYber Security
98                                CYber Security
99                                CYber Security
Name: Column4, Length: 100, dtype: object

In [49]:
df

,COlumn1,COlumn2,COlumn3,Column4,Column5
0,0,58.000000,1,Artificial Intelligence & Data Analytics,E03
1,0,58.000000,2,CYber Security,E02
2,0,57.666667,3,Artificial Intelligence & Machine Learning,E01
3,1,57.666667,4,Artificial Intelligence & Data Analytics,E03
4,0,57.666667,5,CYber Security,E02
...,...,...,...,...,...
95,1,57.666667,96,Artificial Intelligence & Machine Learning,E01
96,0,57.666667,97,Artificial Intelligence & Data Analytics,E03
97,1,57.666667,98,CYber Security,E02
98,0,57.666667,99,CYber Security,E02
99,47,57.000000,100,CYber Security,E02

In [50]:
df=pd.read_clipboard()

In [51]:
df

    1  67  1000
0   2  17  1547
1   5  96  2587
2   6  74  4586
3   3  38  3578
4   4  87  1486
5   8  54  5713
6   3  43  9841
7   4  23  2684
8   2  32  7513
9   4  23  9855
10  5  23  4521
11  3  12  1564

In [53]:
df['new1']=df['1']/max(df['1'])

In [54]:
df

    1  67  1000   new1
0   2  17  1547  0.250
1   5  96  2587  0.625
2   6  74  4586  0.750
3   3  38  3578  0.375
4   4  87  1486  0.500
5   8  54  5713  1.000
6   3  43  9841  0.375
7   4  23  2684  0.500
8   2  32  7513  0.250
9   4  23  9855  0.500
10  5  23  4521  0.625
11  3  12  1564  0.375

In [55]:
df['new2']=(min(df['67'])-df['67'])/(max(df['67'])-min(df['67']))

In [56]:
df

    1  67  1000   new1      new2
0   2  17  1547  0.250 -0.059524
1   5  96  2587  0.625 -1.000000
2   6  74  4586  0.750 -0.738095
3   3  38  3578  0.375 -0.309524
4   4  87  1486  0.500 -0.892857
5   8  54  5713  1.000 -0.500000
6   3  43  9841  0.375 -0.369048
7   4  23  2684  0.500 -0.130952
8   2  32  7513  0.250 -0.238095
9   4  23  9855  0.500 -0.130952
10  5  23  4521  0.625 -0.130952
11  3  12  1564  0.375  0.000000

In [61]:
df['new3']=(df['1000']-(df['1000'].mean()))/(df['1000']).std()

In [62]:
df

    1  67  1000   new1      new2      new3
0   2  17  1547  0.250 -0.059524 -1.011055
1   5  96  2587  0.625 -1.000000 -0.669207
2   6  74  4586  0.750 -0.738095 -0.012135
3   3  38  3578  0.375 -0.309524 -0.343465
4   4  87  1486  0.500 -0.892857 -1.031106
5   8  54  5713  1.000 -0.500000  0.358311
6   3  43  9841  0.375 -0.369048  1.715186
7   4  23  2684  0.500 -0.130952 -0.637323
8   2  32  7513  0.250 -0.238095  0.949972
9   4  23  9855  0.500 -0.130952  1.719788
10  5  23  4521  0.625 -0.130952 -0.033500
11  3  12  1564  0.375  0.000000 -1.005467